{
  "backend/main.mo": "Main Motoko actor implementing speaking practice session management with authorization, user profiles, prompts, and sessions. Includes CRUD operations for prompts, session lifecycle management, and role-based access control for students and teachers.",
  "feature_evidence.json": "Feature evidence report mapping four main features (speaking practice UI, teacher functionality, prompt library, and visual theme) to their implementing files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing React components, pages, hooks, and configuration for the English speaking practice application.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color palette with warm educational theme using coral/orange primary colors and soft peach secondary colors for both light and dark modes.",
  "frontend/index.html": "HTML entry point with root div and module script loading the React application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for practice, library, teacher dashboard, session review, and admin pages, wrapped in theme provider with role guards and profile setup modal.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-screen access denied message component with shield icon and return button for unauthorized access attempts.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with navigation header, gradient background, main content area, and footer with caffeine.ai attribution and UTM tracking.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity authentication button component handling login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/Navigation.tsx": "Main navigation header component with logo, authenticated navigation links (Practice, Library, Teacher, Manage), role-based visibility for admin routes, and login/profile display.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that appears for authenticated users without a profile, prompting them to enter their name and create a student profile.",
  "frontend/src/components/PromptCard.tsx": "Card component displaying a speaking prompt with title, description, difficulty badge, and a button to start practice session.",
  "frontend/src/components/PromptFilters.tsx": "Filter controls for prompts including a search input and difficulty level dropdown selector.",
  "frontend/src/components/RoleGuard.tsx": "Authorization wrapper component that checks user role and displays AccessDeniedScreen if user lacks required permissions (admin or user).",
  "frontend/src/components/SessionHistory.tsx": "Displays a list of user's practice sessions with status badges, dates, feedback snippets, and view buttons, sorted by most recent first.",
  "frontend/src/components/SessionReviewForm.tsx": "Form component for teachers to submit feedback on a student's practice session with a textarea and submit button.",
  "frontend/src/components/UserProfileDisplay.tsx": "Displays the current user's avatar with initials, name, and optional teacher badge in the navigation area.",
  "frontend/src/components/WelcomeHero.tsx": "Hero section with headline, description about English speaking practice, and an illustration image in a gradient background.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializes admin access control, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating prompts, sessions, and user profiles, integrating with the backend actor and managing cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm educational color palette for light and dark modes, including primary, secondary, accent, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminPromptManagement.tsx": "Admin page for creating and viewing speaking exercise prompts with form inputs for title, description, and difficulty level selection.",
  "frontend/src/pages/PracticePage.tsx": "Main practice page displaying available prompts with filtering, allowing authenticated users to start sessions and view their practice history via tabs.",
  "frontend/src/pages/PromptLibrary.tsx": "Public library view displaying all speaking prompts in a grid with difficulty badges and search/filter functionality.",
  "frontend/src/pages/SessionPage.tsx": "Student-facing page for viewing and completing a practice session, displaying prompt details, difficulty level, status badges, and a form to submit recording URLs.",
  "frontend/src/pages/SessionReviewPage.tsx": "Teacher-facing page for reviewing student practice sessions, showing session details, student recordings, and embedding the SessionReviewForm component for providing feedback.",
  "frontend/src/pages/TeacherDashboard.tsx": "Teacher dashboard displaying statistics and a table of all student sessions with status badges, filterable by review status, and navigation to individual session reviews.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both standard query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended utilities, typography, animations, and design tokens for the UI component system.",
  "project_state.json": "Project metadata tracking implemented features (student practice UI, teacher functionality, prompt library, visual theme) and pending feature requests for the English speaking practice application."
}